{
  "id": "FIP-0077",
  "title": "Add Cost Opportunity For New Miner Creation",
  "description": "A deposit requirement for creating new miner actors to prevent unnecessary miner ID creation and potential network spam attacks",
  "showDetailedImpact": true,
  "impacts": {
    "endUsers": [
      "No direct impact: End users (those who store or retrieve data) are not involved in miner creation, so this FIP does not directly affect them.",
      "Indirect network benefit: By reducing unnecessary miner IDs and potential network spam, the overall network efficiency may improve, indirectly benefitting end users.",
      "No need for user action: End users do not need to adapt or change their behavior due to this FIP."
    ],
    "applicationDevelopers": [
      "Minimal direct impact as most apps do not handle miner creation.",
      "Improved network stability may benefit applications.",
      "API compatibility: Apps that automate miner creation can now rely on reduced spam and more predictable network behavior.",
      "If the application handles miner creation, it needs to update error handling and support the deposit parameter."
    ],
    "storageProviders": [
      "Discourages wasteful creation of unused miner actors, making the network more efficient.",
      "Deposit is refundable (vested over 180 days), so legitimate storage providers are not permanently penalized.",
      "Reduces incentive for spam or mass miner creation, leading to fairer network conditions.",
      "Increased entry and operational cost when creating new miner actors.",
      "Existing operational scripts and onboarding procedures may need updates to handle the deposit requirement."
    ],
    "toolingInfrastructureDevelopers": [
      "Clearer process for handling miner creation, as deposit logic is now standardized.",
      "Fewer spam miner actors to track, simplifying monitoring and analytics.",
      "SDKs, CLI tools, and automation scripts must be updated to support the new deposit mechanism and related error handling.",
      "Automated tests and documentation will require updates."
    ]
  }
}
